<a href="https://colab.research.google.com/github/I-Git5G/python-learnings/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Name	Age	City
#Alice	25	New York
#Bob	30	Los Angeles
#Charlie	35	Chicago

import pandas as pd
data = {
     'name':['alice','bob','charlie'],
     'age':[25,30,35],
     'city':['newyork','los angeles','chicago']
 }

df = pd.DataFrame(data)
print(df)

      name  age         city
0    alice   25      newyork
1      bob   30  los angeles
2  charlie   35      chicago

In [ ]:
# Create a DataFrame from the following dictionary:
# ✅ Tasks:
# 1. Create the DataFrame.
# 2. Display the first 3 rows.
# 3. Display data types of each column
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'Score': [85, 62, 90, 70, 88]
}
df=pd.DataFrame(data)
print(df)
df=df.head(3)
print(df)
print(df.dtypes)

      Name  Age  Score
0    Alice   24     85
1      Bob   27     62
2  Charlie   22     90
3    David   32     70
4      Eva   29     88
      Name  Age  Score
0    Alice   24     85
1      Bob   27     62
2  Charlie   22     90
Name     object
Age       int64
Score     int64
dtype: object

In [ ]:
# ✅ Tasks:
# 1. Find the average age.
# 2. Find the maximum score.
# 3. Count how many people have a score above 80.

import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'Score': [85, 62, 90, 70, 88]
}
df=pd.DataFrame(data)
print(df)
average_age=df['Age'].mean()
print(average_age)
maximum_score=df['Score'].max()
print(maximum_score)
above_score=df[df['Score']>80]
print("people who have scored above 80:",above_score)

      Name  Age  Score
0    Alice   24     85
1      Bob   27     62
2  Charlie   22     90
3    David   32     70
4      Eva   29     88
26.8
90
people who have scored above 80:       Name  Age  Score
0    Alice   24     85
2  Charlie   22     90
4      Eva   29     88

In [ ]:
# ✅ Tasks:
# 1. Filter rows where Age is greater than 25.
# 2. Filter rows where Score is above 80 and Age is below 30.

import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'Score': [85, 62, 90, 70, 88]
}
df=pd.DataFrame(data)
print(df)
greater_age=df[df['Age']>25]
print("greater then 25 years:")
print(greater_age)
score_age=df[(df['Score']>80) & (df['Age']<30)]
print("People with Score > 80 and Age < 30:")
print(score_age)

      Name  Age  Score
0    Alice   24     85
1      Bob   27     62
2  Charlie   22     90
3    David   32     70
4      Eva   29     88
greater then 25 years:
    Name  Age  Score
1    Bob   27     62
3  David   32     70
4    Eva   29     88
People with Score > 80 and Age < 30:
      Name  Age  Score
0    Alice   24     85
2  Charlie   22     90
4      Eva   29     88

In [ ]:
import pandas as pd

data = {
    'OrderID': [101, 102, 103, 104, 105, 106],
    'Customer': ['Alice', 'Bob', 'Alice', 'David', 'Eve', 'Frank'],
    'Product': ['Laptop', 'Tablet', 'Monitor', 'Laptop', 'Monitor', 'Tablet'],
    'Quantity': [1, 2, 1, 3, 2, 1],
    'Price': [1200, 300, 200, 1150, 220, 310],
    'OrderDate': ['2023-06-01', '2023-06-03', '2023-06-04', '2023-06-07', '2023-06-10', '2023-06-11']
}
#Display the first 3 rows of the DataFrame.
#Show all orders made by Alice.
#Calculate the total revenue (Price × Quantity).
#Add a new column called TotalAmount = Price × Quantity.
#Sort the DataFrame by TotalAmount in descending order.
#Find the most sold product by quantity.
#Calculate total revenue by each customer.
#How many unique products were sold?
#Group data by Product and calculate total revenue per product.
#Resample the sales by week and show total quantity sold.


import pandas as pd
df=pd.DataFrame(data)
print(df)

df.head(3)
alice_orders=df[df["Customer"]=="Alice"]
print(alice_orders)
Total_Revenue=df["Price"]*df["Quantity"]
print(Total_Revenue)
df['Total_amount']=df["Price"]*df["Quantity"]
print(df)
df=df.sort_values(by='Total_amount',ascending=False)
print(df)
product_sales = df.groupby('Product')['Quantity'].sum()
print(product_sales)
df['revenue']=df['Price']*df['Quantity']
Customer_revenue=df.groupby('Customer')['revenue'].sum().reset_index()
print(Customer_revenue)
unique_products=df['Product'].unique()
print(unique_products)
total_revenue=df.groupby('Product').agg({'revenue':'sum'}).reset_index()
print(total_revenue)

   OrderID Customer  Product  Quantity  Price   OrderDate
0      101    Alice   Laptop         1   1200  2023-06-01
1      102      Bob   Tablet         2    300  2023-06-03
2      103    Alice  Monitor         1    200  2023-06-04
3      104    David   Laptop         3   1150  2023-06-07
4      105      Eve  Monitor         2    220  2023-06-10
5      106    Frank   Tablet         1    310  2023-06-11
   OrderID Customer  Product  Quantity  Price   OrderDate
0      101    Alice   Laptop         1   1200  2023-06-01
2      103    Alice  Monitor         1    200  2023-06-04
0    1200
1     600
2     200
3    3450
4     440
5     310
dtype: int64
   OrderID Customer  Product  Quantity  Price   OrderDate  Total_amount
0      101    Alice   Laptop         1   1200  2023-06-01          1200
1      102      Bob   Tablet         2    300  2023-06-03           600
2      103    Alice  Monitor         1    200  2023-06-04           200
3      104    David   Laptop         3   1150  2023-06-07          3450
4      105      Eve  Monitor         2    220  2023-06-10           440
5      106    Frank   Tablet         1    310  2023-06-11           310
   OrderID Customer  Product  Quantity  Price   OrderDate  Total_amount
3      104    David   Laptop         3   1150  2023-06-07          3450
0      101    Alice   Laptop         1   1200  2023-06-01          1200
1      102      Bob   Tablet         2    300  2023-06-03           600
4      105      Eve  Monitor         2    220  2023-06-10           440
5      106    Frank   Tablet         1    310  2023-06-11           310
2      103    Alice  Monitor         1    200  2023-06-04           200
Product
Laptop     4
Monitor    3
Tablet     3
Name: Quantity, dtype: int64
  Customer  revenue
0    Alice     1400
1      Bob      600
2    David     3450
3      Eve      440
4    Frank      310
['Laptop' 'Tablet' 'Monitor']
   Product  revenue
0   Laptop     4650
1  Monitor      640
2   Tablet      910

In [ ]:
import pandas as pd
from io import StringIO

csv_data ="""employee_id,name,email,department,hire_date,salary
1001,Emily Johnson,emily.johnson@example.com,Engineering,2018-06-15,95000
1002,Michael Smith,michael.smith@example.com,Marketing,2020-02-10,72000
1003,Sophia Lee,sophia.lee@example.com,Sales,2019-08-21,68000
1004,Liam Martinez,liam.martinez@example.com,HR,2016-12-03,75000
1005,Olivia Brown,olivia.brown@example.com,Finance,2021-03-27,82000
1006,Noah Davis,noah.davis@example.com,Engineering,2017-05-18,105000
1007,Ava Wilson,ava.wilson@example.com,Sales,2022-07-11,65000
1008,Ethan Moore,ethan.moore@example.com,Marketing,2015-10-30,78000
1009,Isabella Taylor,isabella.taylor@example.com,Finance,2023-01-05,88000
1010,James Anderson,james.anderson@example.com,HR,2014-09-20,70000"""
#Filter employees from the Engineering department.
#Find the average salary by department.
#Sort by hire date (earliest to latest).
#Add a column that calculates years of experience (based on hire_date).
#Export a subset of high earners (e.g., salary > 90000) to a new CSV


df=pd.read_csv(StringIO(csv_data))
print(df)

filter_employee=df[df['department']=='Engineering']
print(filter_employee)

Avg_salary=df.groupby('department')['salary'].mean()
print(Avg_salary)
df=df.sort_values(by='hire_date',ascending=True)
print(df)

pd.DataFrame(df)

from datetime import datetime
df['hire_date']=pd.to_datetime(df['hire_date'])
today = pd.to_datetime('today')
df['years_experience'] = (today - df['hire_date']).dt.days // 365
print(df)

   employee_id             name                        email   department  \
0         1001    Emily Johnson    emily.johnson@example.com  Engineering
1         1002    Michael Smith    michael.smith@example.com    Marketing
2         1003       Sophia Lee       sophia.lee@example.com        Sales
3         1004    Liam Martinez    liam.martinez@example.com           HR
4         1005     Olivia Brown     olivia.brown@example.com      Finance
5         1006       Noah Davis       noah.davis@example.com  Engineering
6         1007       Ava Wilson       ava.wilson@example.com        Sales
7         1008      Ethan Moore      ethan.moore@example.com    Marketing
8         1009  Isabella Taylor  isabella.taylor@example.com      Finance
9         1010   James Anderson   james.anderson@example.com           HR

    hire_date  salary
0  2018-06-15   95000
1  2020-02-10   72000
2  2019-08-21   68000
3  2016-12-03   75000
4  2021-03-27   82000
5  2017-05-18  105000
6  2022-07-11   65000
7  2015-10-30   78000
8  2023-01-05   88000
9  2014-09-20   70000
   employee_id           name                      email   department  \
0         1001  Emily Johnson  emily.johnson@example.com  Engineering
5         1006     Noah Davis     noah.davis@example.com  Engineering

    hire_date  salary
0  2018-06-15   95000
5  2017-05-18  105000
department
Engineering    100000.0
Finance         85000.0
HR              72500.0
Marketing       75000.0
Sales           66500.0
Name: salary, dtype: float64
   employee_id             name                        email   department  \
9         1010   James Anderson   james.anderson@example.com           HR
7         1008      Ethan Moore      ethan.moore@example.com    Marketing
3         1004    Liam Martinez    liam.martinez@example.com           HR
5         1006       Noah Davis       noah.davis@example.com  Engineering
0         1001    Emily Johnson    emily.johnson@example.com  Engineering
2         1003       Sophia Lee       sophia.lee@example.com        Sales
1         1002    Michael Smith    michael.smith@example.com    Marketing
4         1005     Olivia Brown     olivia.brown@example.com      Finance
6         1007       Ava Wilson       ava.wilson@example.com        Sales
8         1009  Isabella Taylor  isabella.taylor@example.com      Finance

    hire_date  salary
9  2014-09-20   70000
7  2015-10-30   78000
3  2016-12-03   75000
5  2017-05-18  105000
0  2018-06-15   95000
2  2019-08-21   68000
1  2020-02-10   72000
4  2021-03-27   82000
6  2022-07-11   65000
8  2023-01-05   88000
   employee_id             name                        email   department  \
9         1010   James Anderson   james.anderson@example.com           HR
7         1008      Ethan Moore      ethan.moore@example.com    Marketing
3         1004    Liam Martinez    liam.martinez@example.com           HR
5         1006       Noah Davis       noah.davis@example.com  Engineering
0         1001    Emily Johnson    emily.johnson@example.com  Engineering
2         1003       Sophia Lee       sophia.lee@example.com        Sales
1         1002    Michael Smith    michael.smith@example.com    Marketing
4         1005     Olivia Brown     olivia.brown@example.com      Finance
6         1007       Ava Wilson       ava.wilson@example.com        Sales
8         1009  Isabella Taylor  isabella.taylor@example.com      Finance

   hire_date  salary  years_experience
9 2014-09-20   70000                10
7 2015-10-30   78000                 9
3 2016-12-03   75000                 8
5 2017-05-18  105000                 7
0 2018-06-15   95000                 6
2 2019-08-21   68000                 5
1 2020-02-10   72000                 5
4 2021-03-27   82000                 4
6 2022-07-11   65000                 2
8 2023-01-05   88000                 2

In [ ]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 29],
    'Gender': ['F', 'M', 'M', 'M', 'F'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
    'Salary': [50000, 60000, 70000, 80000, 52000]
}
#View Data:
#Print the first 3 rows of the DataFrame.
#Show the DataFrame info and data types.
#Selection & Filtering:
#Select the "Name" and "Salary" columns.
#Filter the rows where Department is "IT".
#Find all employees older than 30.
#Sorting:
#Sort the DataFrame by Age in ascending order.
#Sort by Salary in descending order.
#Aggregation:
#Find the average salary.
#Group by Department and find the average salary for each department.
#Count how many employees are in each department.
#Modifying Columns:
#Add a new column called Tax that is 10% of the salary.
#Create a new column Net Salary = Salary - Tax.
#Missing Values (Optional):
#Add a missing value (e.g., df.loc[2, 'Salary'] = None) and then:
#Fill it with the average salary.
#Drop rows with missing data.
#Exporting:
#Save the DataFrame to a CSV file called "employees.csv".

df=pd.DataFrame(data)
print(df)

df.head(3)

df.info()

df.dtypes

df[['Name','Salary']]

filter_employee=df[df['Department']=='IT']
print(filter_employee)

Older_employee=df[df['Age']>30]
print(Older_employee)

high_salary=df[df['Salary']>50000]
print(high_salary)

df.sort_values(by='Age',ascending=True)

df.sort_values(by='Salary',ascending=False)

Average_Salary=df['Salary'].mean()
print(Average_Salary)

Average_Salary=df.groupby('Department')['Salary'].mean()
print(Average_Salary)

Total_employees=df['Department'].value_counts()
print(Total_employees)

df['Tax']=df['Salary']*0.1
print(df)

df['net_Salary']=df['Salary']-df['Tax']
print(df)

df.isnull().sum()
df.loc[2, 'Salary'] = 70000
df.fillna(Average_Salary)
print(df)

df.dropna()
print(df)

df=pd.DataFrame(data)
df.to_csv('employees.csv',index=False)

      Name  Age Gender Department  Salary
0    Alice   25      F         HR   50000
1      Bob   30      M         IT   60000
2  Charlie   35      M    Finance   70000
3    David   40      M         IT   80000
4      Eve   29      F         HR   52000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Gender      5 non-null      object
 3   Department  5 non-null      object
 4   Salary      5 non-null      int64
dtypes: int64(2), object(3)
memory usage: 332.0+ bytes
    Name  Age Gender Department  Salary
1    Bob   30      M         IT   60000
3  David   40      M         IT   80000
      Name  Age Gender Department  Salary
2  Charlie   35      M    Finance   70000
3    David   40      M         IT   80000
      Name  Age Gender Department  Salary
1      Bob   30      M         IT   60000
2  Charlie   35      M    Finance   70000
3    David   40      M         IT   80000
4      Eve   29      F         HR   52000
62400.0
Department
Finance    70000.0
HR         51000.0
IT         70000.0
Name: Salary, dtype: float64
Department
HR         2
IT         2
Finance    1
Name: count, dtype: int64
      Name  Age Gender Department  Salary     Tax
0    Alice   25      F         HR   50000  5000.0
1      Bob   30      M         IT   60000  6000.0
2  Charlie   35      M    Finance   70000  7000.0
3    David   40      M         IT   80000  8000.0
4      Eve   29      F         HR   52000  5200.0
      Name  Age Gender Department  Salary     Tax  net_Salary
0    Alice   25      F         HR   50000  5000.0     45000.0
1      Bob   30      M         IT   60000  6000.0     54000.0
2  Charlie   35      M    Finance   70000  7000.0     63000.0
3    David   40      M         IT   80000  8000.0     72000.0
4      Eve   29      F         HR   52000  5200.0     46800.0
      Name  Age Gender Department  Salary     Tax  net_Salary
0    Alice   25      F         HR   50000  5000.0     45000.0
1      Bob   30      M         IT   60000  6000.0     54000.0
2  Charlie   35      M    Finance   70000  7000.0     63000.0
3    David   40      M         IT   80000  8000.0     72000.0
4      Eve   29      F         HR   52000  5200.0     46800.0
      Name  Age Gender Department  Salary     Tax  net_Salary
0    Alice   25      F         HR   50000  5000.0     45000.0
1      Bob   30      M         IT   60000  6000.0     54000.0
2  Charlie   35      M    Finance   70000  7000.0     63000.0
3    David   40      M         IT   80000  8000.0     72000.0
4      Eve   29      F         HR   52000  5200.0     46800.0